# Задание №1: 
animal_type = input("Введите вид питомца: ")
animal_age = input("Введите возраст питомца: ")
animal_name = input("Введите кличку питомца: ")

print(f'Это {animal_type} по кличке "{animal_name}". Возраст: {animal_age} года.')


