# Задание №2:
stage1 = input("Введите первую стадию развития человека: ")
stage2 = input("Введите вторую стадию: ")
stage3 = input("Введите третью стадию: ")
stage4 = input("Введите четвёртую стадию: ")
stage5 = input("Введите пятую стадию: ")

print(stage1, stage2, stage3, stage4, stage5, sep=" => ")

