# Задание 1:
a = float(input("Введите длину стороны A: "))
b = float(input("Введите длину стороны B: "))

area = a * b
perimeter = 2 * (a + b)

print(f"Площадь: {area}")
print(f"Периметр: {perimeter}")
